
// for (let i = 0; i < 10; i++){
//     console.log("홍길동")
// }

// console.log("반복문 종료")


//홀수만 출력 (1~10) : 1,3,5,7,9
for(let i = 0; i < 9; i+=2){
    console.log(i + 1)
}
console.log("반복문 종료")



//10~1 출력하기

for (let i = 10 ; i > 0; i--){
    console.log(i)
}

//i는 0부터 시작하는 것이 좋음
//i--를 넣는 것보단 알고리즘을 생각하며 푸는 것이 좋음
//문제를 풀 때 알고리즘을 적기 

for(let i = 0; i < 10; i++){
    // 10 - i = 10
    // 10 - i = 9
    // 10 - i = 8
    // 10 - i = 7 
    // 10 - i = 6
    // 10 - i = 5
    // 10 - i = 4
    // 10 - i = 3
    // 10 - i = 2
    // 10 - i = 1
    console.log(10 - i)
}